13xforever.language-x86-64-assembly
1dot75cm.RPMSpec
bungcip.better-toml
codezombiech.gitignore
DavidAnson.vscode-markdownlint
dcasella.monokai-plusplus
DevonDCarew.bazel-code
dinhani.copy-on-select
DotJoshJohnson.xml
eamodio.gitlens
fabiospampinato.vscode-statusbar-debugger
ian-h-chamberlain.redcode
korekontrol.saltstack
kumar-harsh.graphql-for-vscode
marko2276.yang
matklad.rust-analyzer
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-python.python
ms-vscode.cpptools
ms-vscode.Go
ritwickdey.LiveServer
skyapps.fish-vscode
sleistner.vscode-fileutils
slevesque.shader
timonwong.shellcheck
Tobiah.unity-tools
TomiTurtiainen.rf-intellisense
twxs.cmake
Unity.unity-debug
vsciot-vscode.vscode-arduino
vscode-org-mode.org-mode
vscodevim.vim
wayou.vscode-todo-highlight
xoronic.pestfile
zhouronghui.propertylist
zxh404.vscode-proto3
